Revit 2024 API
IFCConnectedWallData.ElementId Property
 The element id to which this element is joined.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public ElementId ElementId { get; }
Visual Basic
Public ReadOnly Property ElementId As ElementId
	Get
Visual C++
public:
property ElementId^ ElementId {
	ElementId^ get ();
}
See Also
IFCConnectedWallData Class
Autodesk.Revit.DB.IFC Namespace